// Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет

int n = 78;
int a = (n / 100);
int b = ((n / 10) % 10);
int c = (n % 10);

int(c = double)
{
    Console.WriteLine("третьей цифры нет");
}
else Console.WriteLine(c);