// Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет

int n = 78;
int a = (n / 100);
int b = ((n / 10) % 10);
int c = -1;

Console.WriteLine(c);

if (c = (n % 10))
{
    Console.WriteLine(c);
}
Console.WriteLine("третьей цифры нет");