// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

int n = 918;
int b = (n / 10) % 10;

Console.WriteLine(b);