// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
// 1 вывести трёхзначное число - 456
// 2 разбить число на цифры
// 3 составить новое число - 5
// 4 вывести не экран


int n = 918;
int b = (n / 10) % 10;

Console.WriteLine(b);