// Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным
//1 ввести цифру от пользовотеля
//2 определить массив (дни недели)
//3 вывести индекс каждого значения в массиве
//4 определить в данном массиве выходные и будние дни
//4 присвоить к каждому индексу номер дня недели (1-7)
//5 сопоставить цифру от пользоателя к номеру дня недели
//6 вывести ответ

//1
int NumberDays(string text)
{
  Console.Write(text);
  int value = int.Parse(Console.ReadLine());
  return value;
}

//2
int[] DaysWeekArray{1, 2, 3, 4, 5, 5, 7}
{
  int Length = array.Length;
  int index = 0;
}

int countElements = NumberDays("Введите цифру обозначающую день недели: ");
